###*
	@module Keypad
	@author muchweb
###

'use strict'

# English
exports.en =
	'1': [
		'.'
		','
		'?'
		'!'
		'\''
		'"'
		'1'
		'-'
		'('
		')'
		'@'
		'/'
		':'
		'_'
	]
	'2': [
		'a'
		'b'
		'c'
		'2'
		'ä'
		'æ'
		'å'
		'à'
		'á'
		'â'
		'ã'
		'ç'
	]
	'3': [
		'd'
		'e'
		'f'
		'3'
		'è'
		'é'
		'ê'
		'ð'
	]
	'4': [
		'g'
		'h'
		'i'
		'4'
		'ì'
		'í'
		'î'
		'ï'
	]
	'5': [
		'j'
		'k'
		'l'
		'5'
		'£'
	]
	'6': [
		'm'
		'n'
		'o'
		'6'
		'ö'
		'ø'
		'ò'
		'ó'
		'ô'
		'õ'
		'ñ'
	]
	'7': [
		'p'
		'q'
		'r'
		's'
		'7'
		'ß'
		'$'
	]
	'8': [
		't'
		'u'
		'v'
		'8'
		'ù'
		'ú'
		'û'
		'ü'
	]
	'9': [
		'w'
		'x'
		'y'
		'z'
		'9'
		'ý'
		'þ'
	]
	# Used for special character selection
	'*': [
	]
	'0': [
		' '
		'0'
		'\n'
	]
	# Used for case selection
	'#': [
		'CASE'
	]

# German
exports.de =
	'1': [
		'.'
		','
		'?'
		'!'
		'\''
		'"'
		'1'
		'-'
		'('
		')'
		'@'
		'/'
		':'
		'_'
	]
	'2': [
		'a'
		'b'
		'c'
		'2'
		'ä'
		'à'
		'á'
		'ã'
		'â'
		'å'
		'æ'
		'ç'
	]
	'3': [
		'd'
		'e'
		'f'
		'3'
		'è'
		'é'
		'ë'
		'ê'
		'ð'
	]
	'4': [
		'g'
		'h'
		'i'
		'4'
		'ì'
		'í'
		'î'
		'ï'
	]
	'5': [
		'j'
		'k'
		'l'
		'5'
		'£'
	]
	'6': [
		'm'
		'n'
		'o'
		'6'
		'ò'
		'ó'
		'ô'
		'õ'
		'ö'
		'ø'
		'ñ'
	]
	'7': [
		'p'
		'q'
		'r'
		's'
		'7'
		'ß'
		'$'
	]
	'8': [
		't'
		'u'
		'v'
		'8'
		'ü'
		'ù'
		'ú'
		'û'
	]
	'9': [
		'w'
		'x'
		'y'
		'z'
		'9'
		'ý'
		'þ'
	]
	# Used for special character selection
	'*': [
	]
	'0': [
		' '
		'0'
		'\n'
	]
	# Used for case selection
	'#': [
		'CASE'
	]
